In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("D:\Instahyre\locations.csv")

In [4]:
df

     job_id   job_locations
0    270735  Work From Home
1    270736  Work From Home
2    272101       Bangalore
3    270555       Bangalore
4    270071          Mumbai
..      ...             ...
780  271414           Noida
781  271419         Chennai
782  271416       Hyderabad
783  271415          Jaipur
784  271406         Gurgaon

[785 rows x 2 columns]

In [5]:
from geopy.geocoders import Nominatim

In [6]:
geolocator = Nominatim(user_agent="geoapiExercises")

In [7]:
def get_lat_long(location):
    try:
        location = geolocator.geocode(location)
        if location:
            return location.latitude, location.longitude
        else:
            return None, None
    except:
        return None, None

In [8]:
df['job_locations'] = df['job_locations'].apply(lambda x:x.strip())

In [9]:
df['job_locations'] = df['job_locations'].replace("Work From Home","Agra")

In [10]:
df

     job_id job_locations
0    270735          Agra
1    270736          Agra
2    272101     Bangalore
3    270555     Bangalore
4    270071        Mumbai
..      ...           ...
780  271414         Noida
781  271419       Chennai
782  271416     Hyderabad
783  271415        Jaipur
784  271406       Gurgaon

[785 rows x 2 columns]

In [11]:
get_lat_long("Agra")

(27.1752554, 78.0098161)

In [12]:
df['Latitude'], df['Longitude'] = zip(*df['job_locations'].apply(get_lat_long))

In [13]:
df

     job_id job_locations   Latitude  Longitude
0    270735          Agra  27.175255  78.009816
1    270736          Agra  27.175255  78.009816
2    272101     Bangalore  12.976794  77.590082
3    270555     Bangalore  12.976794  77.590082
4    270071        Mumbai  19.078545  72.878176
..      ...           ...        ...        ...
780  271414         Noida  28.570633  77.327215
781  271419       Chennai  13.083694  80.270186
782  271416     Hyderabad  17.360589  78.474061
783  271415        Jaipur  26.915458  75.818982
784  271406       Gurgaon  28.464615  77.029919

[785 rows x 4 columns]

In [14]:
df.to_csv("lat_long.csv")